extends Node

var mainhealth := [
		{"общЗдоровье" : 100.0},
		[
			[
				{"сердце" : 100},
				[
					{"сердцебиение" : 100.0},
					{"пульс" : 0}
				]
			],
			[
				{"дыхание" : 100},
				[
					{"кисл_насыщение" : 100.0},
					{"вдохВыдох" : 0}
				]
			],
			[
				{"жажда" : 0.0},
				[
					{"вода" : 100.0},
					{"интоксикация" : 0.0}
				]
			],
			[
				{"голод" : 0.0},
				[
					{"жиры" : 25.0},
					{"белки" : 25.0},
					{"углеводы" : 25.0},
					{"клечатка" : 25.0}
				]
			],
			[
				{"параметры" : 4},
				[
					{"ловкость" : 0},
					{"выносливость" : 0},
					{"сила" : 0},
					{"интеллект" : 0}
				]
			],
			[
				{"имуннитет" : 100.0},
				[
					{"питание" : 100.0},
					{"болезни" : []},
					{"кровь" : 100.0}
				]
			],
			[
				{"психика" : 100.0},
				[
					{"стресс" : 0.0},
					{"урБоли" : 0},
					{"адреналин" : 0.0},
					{"недуги" : []}
				]
			]
		]
	]
var standarthealth := []
var parts := [
	[
		{"Голова" : 100.0},
		[
			{"Глаза" : [100.0, 100.0]},
			{"Челюсть" : 100.0},
			{"Уши" : [100.0, 100.0]},
			{"Проблемы" : []}
		]
	],
	[
		{"Шея" : 100.0},
		[
			{"Кожа" : 100.0},
			{"Мышцы" : 100.0},
			{"Горло" : 100.0},
			{"Проблемы" : []},
		]
	],
	[
		{"Грудь" : 100.0},
		[
			{"Кожа" : 100.0},
			{"Мышцы" : 100.0},
			{"Размер груди" : 0},
			{"Проблемы" : {}},
		]
	],
	[
		{"Левая рука" : 100.0},
		[
			{"Левое плечо" : 100.0},
			{"Левое предплечье" : 100.0},
			{"Левая кисть" : 100.0},
		],
		[
			{"Кожа" : 100.0},
			{"Мышцы" : 100.0},
			{"Сухожилия" : 100.0},
			{"Проблемы" : []}
		]
	],
	[
		{"Правая рука" : 100.0},
		[
			{"Правое плечо" : 100.0},
			{"Правое предплечье" : 100.0},
			{"Правая кисть" : 100.0},
		],
		[
			{"Кожа" : 100.0},
			{"Мышцы" : 100.0},
			{"Сухожилия" : 100.0},
			{"Проблемы" : []}
		]
	],
	[
		{"Туловище" : 100.0},
		[
			{"Кожа" : 100.0},
			{"Мышцы" : 100.0},
			{"Поясница" : 100.0},
			{"Проблемы" : []},
		]
	],
	[
		{"Таз" : 100.0},
		[
			{"Кожа" : 100.0},
			{"Мышцы" : 100.0},
			{"Гениталия" : ["", 100.0]},
			{"Проблемы" : []},
		]
	],
	[
		{"Левая нога" : 100.0},
		[
			{"Левое бедро" : 100.0},
			{"Левая голень" : 100.0},
			{"Левая стопа" : 100.0},
			{"Левый мизинчик" : 1.0}
		],
		[
			{"Кожа" : 100.0},
			{"Мышцы" : 100.0},
			{"Сухожилия" : 100.0},
			{"Проблемы" : []}
		]
	],
	[
		{"Правая нога" : 100.0},
		[
			{"Правое бедро" : 100.0},
			{"Правая голень" : 100.0},
			{"Правая стопа" : 100.0},
			{"Правый мизинчик" : 1.0}
		],
		[
			{"Кожа" : 100.0},
			{"Мышцы" : 100.0},
			{"Сухожилия" : 100.0},
			{"Проблемы" : []}
		]
	],
	]

var preset

func _ready() -> void:
	pass

func _process(_delta: float) -> void:
	if GlobalParam.stage == "inGame":
		pass
	pass
